AddictiveInstruments/ADIOS/mios32/STM32G0xx/mios32_uart.c
// $Id: mios32_uart.c 2312 2016-02-27 23:04:51Z tk $
//! \defgroup MIOS32_UART
//!
//! U(S)ART functions for MIOS32 - STM32G0xx
//!
//! Applications shouldn't call these functions directly, instead please use \ref MIOS32_COM or \ref MIOS32_MIDI layer functions
//!
//! Up to 8 ports are supported: the 6 USART peripherals present on the
//! 6-USART G0 chip WITHOUT LPUART (STM32G0B0), plus UART6/UART7 which alias
//! LPUART1/LPUART2 on the "+LPUART" sibling tiers (see below). Coverage by
//! chip tier (verified against the CMSIS device-tier macros - STM32G070xx
//! etc, one of which stm32g0xx.h's own dispatcher requires be defined - not
//! the exact MIOS32_PROCESSOR_STM32G070CB part number, so every flash/pin
//! variant of the same silicon is covered automatically):
//!   - 2-USART (G030/G050): UART1/UART2 only (USART1/USART2).
//!   - 2-USART+LPUART1 (G031/G041/G051/G061): UART1/UART2, plus UART6
//!     (LPUART1) on its own independent vector (LPUART1_IRQn) - not shared
//!     with anything.
//!   - 4-USART (G070): UART0..UART3 (USART1..USART4); USART3+4 share one
//!     NVIC vector (USART3_4_IRQn).
//!   - 4-USART+LPUART1 (G071/G081): UART0..UART3 like G070, plus UART6
//!     (LPUART1) - but here USART3+4+LPUART1 share ONE vector together
//!     (USART3_4_LPUART1_IRQn, a different name than the plain 4-USART
//!     tier's USART3_4_IRQn even though the port count is the same).
//!   - 6-USART (G0B0): UART0..UART5 (USART1..USART6); USART3+4+5+6 share one
//!     NVIC vector (USART3_4_5_6_IRQn) - a 4-way share, not the same vector
//!     name as the 4-USART tier above, hence the tier-conditional
//!     MIOS32_UART_SHARED_IRQ_CHANNEL/IRQHANDLER_FUNC macros below.
//!   - 6-USART+2xLPUART (G0B1/G0C1): UART0..UART5 like G0B0, plus UART6
//!     (LPUART1, sharing USART3_4_5_6_LPUART1_IRQn with UART0/3/4/5) and
//!     UART7 (LPUART2) - which, unusually, shares UART2's own vector
//!     instead (USART2_LPUART2_IRQn) - USART2 is NOT independent on this
//!     one tier, unlike every other G0 tier. See MIOS32_UART2_IRQ_CHANNEL/
//!     IRQHANDLER_FUNC below, which are tier-conditional for this reason.
//!
//! LPUART registers alias the same USART_TypeDef layout (ISR/RDR/TDR/CR1 -
//! confirmed in CMSIS: LPUARTx is literally "(USART_TypeDef *)LPUARTx_BASE"),
//! so the generic RXNE/TXE interrupt handling and raw buffer routines below
//! work unchanged for UART6/UART7. Only initialisation differs: LPUART uses
//! its own LL_LPUART_Init/fixed x256 oversampling/PRESC-based BRR formula
//! (see MIOS32_UART_BaudrateSet), not LL_USART_Init. Both LPUART1 and
//! LPUART2 default to PCLK1 as their RCC clock source (MIOS32_UART6/7_
//! CLOCK_SOURCE, overridable) - the same source the other ports already use
//! by default - not LSE: LSE's 32.768kHz is far too slow for a MIDI baud
//! rate (fclk/baudrate ratio would be ~1, LPUART requires >=~3), and the
//! Stop-mode wakeup LSE would otherwise enable isn't used by this driver.
//!
//! Default pin/peripheral assignment (STM32G070CB) - override individually in a
//! local mios32_config.h if your project uses different pins or a different UART
//! peripheral (e.g. STM32G050K8):
//! \code
//!   #define MIOS32_UART0_TX_PORT     GPIOB
//!   #define MIOS32_UART0_TX_PIN      LL_GPIO_PIN_8
//!   #define MIOS32_UART0_TX_AF       LL_GPIO_AF_4
//!   #define MIOS32_UART0_RX_PORT     GPIOB
//!   #define MIOS32_UART0_RX_PIN      LL_GPIO_PIN_9
//!   #define MIOS32_UART0_RX_AF       LL_GPIO_AF_4
//!   #define MIOS32_UART0             USART3
//!   #define MIOS32_UART0_IRQ_CHANNEL USART3_4_IRQn
//!   #define MIOS32_UART0_IRQHANDLER_FUNC void USART3_4_IRQHandler(void)
//!   #define MIOS32_UART0_RESET_FUNC  { ... }
//!   #define MIOS32_UART0_CLOCK_FUNC  { ... }
//! \endcode
//! (same set of defines exists for MIOS32_UART1/UART2/UART3)
//!
//! If your board runs the TX pin through an external level-shifting stage
//! that inverts the signal (e.g. a 3V3->5V transistor for a MIDI DIN output),
//! define MIOS32_UARTx_TX_INVERTED for that port - every port defaults to
//! normal (non-inverted) polarity, this is a per-project hardware fact, not
//! a peripheral default, so it's opt-in only:
//! \code
//!   #define MIOS32_UART0_TX_INVERTED
//! \endcode
//!
//! \{
/* ==========================================================================
 *
 *  Copyright (C) 2008 Thorsten Klose (tk@midibox.org)
 *  Licensed for personal non-commercial use only.
 *  All other rights reserved.
 *
 * ==========================================================================
 */

/////////////////////////////////////////////////////////////////////////////
// Include files
/////////////////////////////////////////////////////////////////////////////

#include <mios32.h>

// auto-derive the master switch from any individual port actually wanted -
// no need for the project to separately set MIOS32_USE_UART on top of
// MIOS32_USE_UARTx. Safe to do locally in this .c file only because nothing
// outside mios32_uart.c ever checks the bare MIOS32_USE_UART macro
// (verified) - unlike MIOS32_USE_SPI, which programming_models/traditional/
// main.c also checks directly, so that one is derived from the shared
// header (mios32_spi.h) instead, not locally in mios32_spi.c.
#if !defined(MIOS32_USE_UART) && (defined(MIOS32_USE_UART0) || defined(MIOS32_USE_UART1) || defined(MIOS32_USE_UART2) || defined(MIOS32_USE_UART3) || defined(MIOS32_USE_UART4) || defined(MIOS32_USE_UART5) || defined(MIOS32_USE_UART6) || defined(MIOS32_USE_UART7))
#define MIOS32_USE_UART
#endif

// this module can be optionally enabled in a local mios32_config.h file (included from mios32.h)
#if defined(MIOS32_USE_UART)

// USART1 (UART1) and USART2 (UART2) exist on EVERY G0 chip - never gated.

// USART3 (UART0) and USART4 (UART3) exist on the 4-USART tier (G070/G071/
// G081) and the 6-USART tier (G0B0/G0B1/G0C1) - checked via the CMSIS
// device-tier macro (defined by stm32g0xx.h's own dispatcher once
// MIOS32_PROCESSOR_xxx has selected a device header) rather than the exact
// MIOS32_PROCESSOR_STM32G070CB part number, so every flash/pin variant of
// the same silicon is covered automatically. The "+LPUART" siblings
// (G071/G081, G0B1/G0C1) are included here too - their shared vector name
// differs (see MIOS32_UART_SHARED_IRQ_CHANNEL below, which is tier-
// conditional for exactly this reason) but is now fully resolved.
#if defined(MIOS32_USE_UART0) && !(defined(STM32G070xx) || defined(STM32G0B0xx) || defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef MIOS32_USE_UART0
#endif
#if defined(MIOS32_USE_UART3) && !(defined(STM32G070xx) || defined(STM32G0B0xx) || defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef MIOS32_USE_UART3
#endif

// USART5 (UART4) and USART6 (UART5) exist on the 6-USART tier, with or
// without LPUART (G0B0/G0B1/G0C1).
#if defined(MIOS32_USE_UART4) && !(defined(STM32G0B0xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef MIOS32_USE_UART4
#endif
#if defined(MIOS32_USE_UART5) && !(defined(STM32G0B0xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef MIOS32_USE_UART5
#endif

