AddictiveInstruments/ADIOS/mios32/STM32G0xx/mios32_uart.c
// UART6 (LPUART1) exists on every "+LPUART" G0 tier (2/4/6-USART siblings).
#if defined(MIOS32_USE_UART6) && !(defined(STM32G031xx) || defined(STM32G041xx) || defined(STM32G051xx) || defined(STM32G061xx) || defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef MIOS32_USE_UART6
#endif

// UART7 (LPUART2) exists ONLY on the 6-USART+2xLPUART tier (G0B1/G0C1) -
// the 2-USART and 4-USART "+LPUART" siblings only ever get one LPUART.
#if defined(MIOS32_USE_UART7) && !(defined(STM32G0B1xx) || defined(STM32G0C1xx))
#undef MIOS32_USE_UART7
#endif

// Tier flag: does this chip's LPUART1 (UART6) share a vector with the
// USART3+ group below (MIOS32_UART_SHARED_IRQ_CHANNEL) instead of having
// its own independent LPUART1_IRQn? True on the 4-USART+LPUART1 and
// 6-USART+2xLPUART tiers; false (independent vector) on the 2-USART+
// LPUART1 tier, where there's no USART3+ group to share with in the first
// place.
#if defined(STM32G071xx) || defined(STM32G081xx) || defined(STM32G0B1xx) || defined(STM32G0C1xx)
#define MIOS32_G0_LPUART1_SHARED 1
#endif

// Tier flag: does this chip have a second LPUART (UART7), which always
// shares USART2's (UART2's) own vector rather than USART2 being
// independent? True only on the 6-USART+2xLPUART tier.
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
#define MIOS32_G0_LPUART2_TIER 1
#endif

// USART3/USART4 (and, on the 6-USART tier, USART5/USART6 too, and on the
// "+LPUART" siblings, LPUART1/UART6 too) share a single NVIC vector - but
// the vector's NAME differs by tier (verified via CMSIS): USART3+4 on the
// plain 4-USART tier, USART3+4+5+6 together on the plain 6-USART tier,
// USART3+4+LPUART1 on the 4-USART+LPUART1 tier, USART3+4+5+6+LPUART1 on the
// 6-USART+2xLPUART tier. Every UARTx macro block below that touches this
// shared vector resolves through these two macros instead of a hardcoded
// name, so the SAME handler function below is correct on every tier
// without a chip-specific #ifdef inside the handler itself.
#if defined(STM32G0B1xx) || defined(STM32G0C1xx)
#define MIOS32_UART_SHARED_IRQ_CHANNEL    USART3_4_5_6_LPUART1_IRQn
#define MIOS32_UART_SHARED_IRQHANDLER_FUNC void USART3_4_5_6_LPUART1_IRQHandler(void)
#elif defined(STM32G0B0xx)
#define MIOS32_UART_SHARED_IRQ_CHANNEL    USART3_4_5_6_IRQn
#define MIOS32_UART_SHARED_IRQHANDLER_FUNC void USART3_4_5_6_IRQHandler(void)
#elif defined(STM32G071xx) || defined(STM32G081xx)
#define MIOS32_UART_SHARED_IRQ_CHANNEL    USART3_4_LPUART1_IRQn
#define MIOS32_UART_SHARED_IRQHANDLER_FUNC void USART3_4_LPUART1_IRQHandler(void)
#else
#define MIOS32_UART_SHARED_IRQ_CHANNEL    USART3_4_IRQn
#define MIOS32_UART_SHARED_IRQHANDLER_FUNC void USART3_4_IRQHandler(void)
#endif


/////////////////////////////////////////////////////////////////////////////
// Pin definitions and USART mappings
/////////////////////////////////////////////////////////////////////////////

// fixed number of port "slots" (buffers, arrays) - independent of how many
// are actually enabled via MIOS32_USE_UARTx, same pattern as mios32_spi.c
#define MIOS32_UART_MAX_PORTS 8

// UART0 (USART3 peripheral) - see MIOS32_USE_UART0 force-undef above (not
// available on the 2-USART tiers). Wrapped in #if defined(MIOS32_USE_UART0)
// like every other port block below (UART2..UART7) - unlike UART1 right
// after it, USART3 does NOT exist on every G0 chip, so leaving this
// unguarded would define MIOS32_UART0 (-> bare "USART3") even on chips
// where that identifier isn't declared by CMSIS at all - harmless today
// only because every actual USE of MIOS32_UART0 elsewhere already re-checks
// MIOS32_USE_UART0 itself, but a latent trap for any future code that
// doesn't.
#if defined(MIOS32_USE_UART0)
#ifndef MIOS32_UART0_TX_PORT
#define MIOS32_UART0_TX_PORT     GPIOB
#endif
#ifndef MIOS32_UART0_TX_PIN
#define MIOS32_UART0_TX_PIN      LL_GPIO_PIN_8
#endif
#ifndef MIOS32_UART0_TX_AF
#define MIOS32_UART0_TX_AF       LL_GPIO_AF_4
#endif
#ifndef MIOS32_UART0_RX_PORT
#define MIOS32_UART0_RX_PORT     GPIOB
#endif
#ifndef MIOS32_UART0_RX_PIN
#define MIOS32_UART0_RX_PIN      LL_GPIO_PIN_9
#endif
#ifndef MIOS32_UART0_RX_AF
#define MIOS32_UART0_RX_AF       LL_GPIO_AF_4
#endif
#ifndef MIOS32_UART0
#define MIOS32_UART0             USART3
#endif
#ifndef MIOS32_UART0_IRQ_CHANNEL
#define MIOS32_UART0_IRQ_CHANNEL MIOS32_UART_SHARED_IRQ_CHANNEL
#endif
#ifndef MIOS32_UART0_IRQHANDLER_FUNC
#define MIOS32_UART0_IRQHANDLER_FUNC MIOS32_UART_SHARED_IRQHANDLER_FUNC
#endif
#ifndef MIOS32_UART0_RESET_FUNC
#define MIOS32_UART0_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART3); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART3); }
#endif
#ifndef MIOS32_UART0_CLOCK_FUNC
#define MIOS32_UART0_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOB); }
#endif
// #define MIOS32_UART0_CLOCK_SOURCE <LL_RCC_USARTx_CLKSOURCE_...>  // not defined by default
#endif

// UART1 (USART1 peripheral) - exists on EVERY G0 tier, never force-undef'd,
// so this #if is purely for structural symmetry with every other port block
// (not strictly required, but keeps "block == #if defined(MIOS32_USE_UARTx)"
// a reliable invariant everywhere in this file).
#if defined(MIOS32_USE_UART1)
#ifndef MIOS32_UART1_TX_PORT
#define MIOS32_UART1_TX_PORT     GPIOB
#endif
#ifndef MIOS32_UART1_TX_PIN
#define MIOS32_UART1_TX_PIN      LL_GPIO_PIN_6
#endif
#ifndef MIOS32_UART1_TX_AF
#define MIOS32_UART1_TX_AF       LL_GPIO_AF_0
#endif
#ifndef MIOS32_UART1_RX_PORT
#define MIOS32_UART1_RX_PORT     GPIOB
#endif
#ifndef MIOS32_UART1_RX_PIN
#define MIOS32_UART1_RX_PIN      LL_GPIO_PIN_7
#endif
#ifndef MIOS32_UART1_RX_AF
#define MIOS32_UART1_RX_AF       LL_GPIO_AF_0
#endif
#ifndef MIOS32_UART1
#define MIOS32_UART1             USART1
#endif
#ifndef MIOS32_UART1_IRQ_CHANNEL
#define MIOS32_UART1_IRQ_CHANNEL USART1_IRQn
#endif
#ifndef MIOS32_UART1_IRQHANDLER_FUNC
#define MIOS32_UART1_IRQHANDLER_FUNC void USART1_IRQHandler(void)
#endif
#ifndef MIOS32_UART1_RESET_FUNC
#define MIOS32_UART1_RESET_FUNC  { LL_APB2_GRP1_ForceReset(LL_APB2_GRP1_PERIPH_USART1); LL_APB2_GRP1_ReleaseReset(LL_APB2_GRP1_PERIPH_USART1); }
#endif
#ifndef MIOS32_UART1_CLOCK_FUNC
#define MIOS32_UART1_CLOCK_FUNC  { LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOB); }
#endif
#ifndef MIOS32_UART1_CLOCK_SOURCE
#define MIOS32_UART1_CLOCK_SOURCE LL_RCC_USART1_CLKSOURCE_PCLK1
#endif
#endif

// UART2 (USART2 peripheral) - exists on EVERY G0 tier (2/4/6-USART, with or
// without LPUART), no force-undef needed. PA2/PA3 chosen over the
// alternative PA14/PA15 pins: those are SWCLK/SWDIO (debug port) on every
// STM32, a real conflict avoided here rather than a hypothetical one.
// IRQ_CHANNEL/IRQHANDLER_FUNC are tier-conditional: on every tier except
// 6-USART+2xLPUART (G0B1/G0C1), USART2 has its own independent vector
// (USART2_IRQn) like everywhere else in this file. On G0B1/G0C1 ONLY,
// USART2 shares its vector with LPUART2/UART7 instead (USART2_LPUART2_IRQn)
// - there is no USART2_IRQn on that one tier. See the combined handler
// further below, which services UART2 and/or UART7 depending on which are
// actually enabled.
#if defined(MIOS32_USE_UART2)
#ifndef MIOS32_UART2_TX_PORT
#define MIOS32_UART2_TX_PORT     GPIOA
#endif
#ifndef MIOS32_UART2_TX_PIN
#define MIOS32_UART2_TX_PIN      LL_GPIO_PIN_2
#endif
#ifndef MIOS32_UART2_TX_AF
#define MIOS32_UART2_TX_AF       LL_GPIO_AF_1
#endif
#ifndef MIOS32_UART2_RX_PORT
#define MIOS32_UART2_RX_PORT     GPIOA
#endif
#ifndef MIOS32_UART2_RX_PIN
#define MIOS32_UART2_RX_PIN      LL_GPIO_PIN_3
#endif
#ifndef MIOS32_UART2_RX_AF
#define MIOS32_UART2_RX_AF       LL_GPIO_AF_1
#endif
#ifndef MIOS32_UART2
#define MIOS32_UART2             USART2
#endif
#ifndef MIOS32_UART2_IRQ_CHANNEL
# if defined(MIOS32_G0_LPUART2_TIER)
#  define MIOS32_UART2_IRQ_CHANNEL USART2_LPUART2_IRQn
# else
#  define MIOS32_UART2_IRQ_CHANNEL USART2_IRQn
# endif
#endif
#ifndef MIOS32_UART2_IRQHANDLER_FUNC
# if defined(MIOS32_G0_LPUART2_TIER)
#  define MIOS32_UART2_IRQHANDLER_FUNC void USART2_LPUART2_IRQHandler(void)
# else
#  define MIOS32_UART2_IRQHANDLER_FUNC void USART2_IRQHandler(void)
# endif
#endif
#ifndef MIOS32_UART2_RESET_FUNC
#define MIOS32_UART2_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART2); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART2); }
#endif
#ifndef MIOS32_UART2_CLOCK_FUNC
#define MIOS32_UART2_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOA); }
#endif
#endif

// UART3 (USART4 peripheral) - exists on the 4-USART tier (G070) and the
// 6-USART tier (G0B0), see MIOS32_USE_UART3 force-undef above. Shares the
// tier-appropriate MIOS32_UART_SHARED_IRQ_CHANNEL vector with UART0 (and,
// on the 6-USART tier, also with UART4/UART5) - the IRQ handler is written
// once below and services whichever of these ports is actually enabled.
#if defined(MIOS32_USE_UART3)
#ifndef MIOS32_UART3_TX_PORT
#define MIOS32_UART3_TX_PORT     GPIOA
#endif
#ifndef MIOS32_UART3_TX_PIN
#define MIOS32_UART3_TX_PIN      LL_GPIO_PIN_0
#endif
#ifndef MIOS32_UART3_TX_AF
#define MIOS32_UART3_TX_AF       LL_GPIO_AF_4
#endif
#ifndef MIOS32_UART3_RX_PORT
#define MIOS32_UART3_RX_PORT     GPIOA
#endif
#ifndef MIOS32_UART3_RX_PIN
#define MIOS32_UART3_RX_PIN      LL_GPIO_PIN_1
#endif
#ifndef MIOS32_UART3_RX_AF
#define MIOS32_UART3_RX_AF       LL_GPIO_AF_4
#endif
#ifndef MIOS32_UART3
#define MIOS32_UART3             USART4
#endif
#ifndef MIOS32_UART3_IRQ_CHANNEL
#define MIOS32_UART3_IRQ_CHANNEL MIOS32_UART_SHARED_IRQ_CHANNEL
#endif
#ifndef MIOS32_UART3_RESET_FUNC
#define MIOS32_UART3_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART4); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART4); }
#endif
#ifndef MIOS32_UART3_CLOCK_FUNC
#define MIOS32_UART3_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART4); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOA); }
#endif
#endif

// UART4 (USART5 peripheral) - only exists on the 6-USART tier (G0B0), see
// MIOS32_USE_UART4 force-undef above. Shares MIOS32_UART_SHARED_IRQ_CHANNEL
// with UART0/UART3/UART5 on this tier.
// PIN MAPPING NOT VERIFIED against a real reference manual or reference
// hardware (no G0B0 board in hand this session) - override
// MIOS32_UART4_{TX,RX}_{PORT,PIN,AF} in your project's mios32_config.h once
// you have real hardware. Chosen only to avoid an obvious collision with
// UART0..UART3's own default pins above.
#if defined(MIOS32_USE_UART4)
#ifndef MIOS32_UART4_TX_PORT
#define MIOS32_UART4_TX_PORT     GPIOC
#endif
#ifndef MIOS32_UART4_TX_PIN
#define MIOS32_UART4_TX_PIN      LL_GPIO_PIN_0
#endif
#ifndef MIOS32_UART4_TX_AF
#define MIOS32_UART4_TX_AF       LL_GPIO_AF_1
#endif
#ifndef MIOS32_UART4_RX_PORT
#define MIOS32_UART4_RX_PORT     GPIOC
#endif
#ifndef MIOS32_UART4_RX_PIN
#define MIOS32_UART4_RX_PIN      LL_GPIO_PIN_1
#endif
#ifndef MIOS32_UART4_RX_AF
#define MIOS32_UART4_RX_AF       LL_GPIO_AF_1
#endif
#ifndef MIOS32_UART4
#define MIOS32_UART4             USART5
#endif
#ifndef MIOS32_UART4_IRQ_CHANNEL
#define MIOS32_UART4_IRQ_CHANNEL MIOS32_UART_SHARED_IRQ_CHANNEL
#endif
#ifndef MIOS32_UART4_RESET_FUNC
#define MIOS32_UART4_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART5); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART5); }
#endif
#ifndef MIOS32_UART4_CLOCK_FUNC
#define MIOS32_UART4_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART5); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOC); }
#endif
#endif

// UART5 (USART6 peripheral) - only exists on the 6-USART tier (G0B0/G0B1/
// G0C1), see MIOS32_USE_UART5 force-undef above. Shares
// MIOS32_UART_SHARED_IRQ_CHANNEL with UART0/UART3/UART4 (and, on the
// "+LPUART" sibling of this tier, UART6/LPUART1 too) on this tier.
// PIN MAPPING NOT VERIFIED - see UART4 above, same caveat applies.
#if defined(MIOS32_USE_UART5)
#ifndef MIOS32_UART5_TX_PORT
#define MIOS32_UART5_TX_PORT     GPIOC
#endif
#ifndef MIOS32_UART5_TX_PIN
#define MIOS32_UART5_TX_PIN      LL_GPIO_PIN_2
#endif
#ifndef MIOS32_UART5_TX_AF
#define MIOS32_UART5_TX_AF       LL_GPIO_AF_2
#endif
#ifndef MIOS32_UART5_RX_PORT
#define MIOS32_UART5_RX_PORT     GPIOC
#endif
#ifndef MIOS32_UART5_RX_PIN
#define MIOS32_UART5_RX_PIN      LL_GPIO_PIN_3
#endif
#ifndef MIOS32_UART5_RX_AF
#define MIOS32_UART5_RX_AF       LL_GPIO_AF_2
#endif
#ifndef MIOS32_UART5
#define MIOS32_UART5             USART6
#endif
#ifndef MIOS32_UART5_IRQ_CHANNEL
#define MIOS32_UART5_IRQ_CHANNEL MIOS32_UART_SHARED_IRQ_CHANNEL
#endif
#ifndef MIOS32_UART5_RESET_FUNC
#define MIOS32_UART5_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART6); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART6); }
#endif
#ifndef MIOS32_UART5_CLOCK_FUNC
#define MIOS32_UART5_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART6); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOC); }
#endif
#endif

