AddictiveInstruments/ADIOS/mios32/STM32G0xx/mios32_uart.c
// UART6 (LPUART1 peripheral) - exists on every "+LPUART" G0 tier, see
// MIOS32_USE_UART6 force-undef above. Vector depends on tier
// (MIOS32_G0_LPUART1_SHARED, set above): independent LPUART1_IRQn on the
// 2-USART+LPUART1 tier, or the shared MIOS32_UART_SHARED_IRQ_CHANNEL
// group (with UART0/UART3[/UART4/UART5]) on the 4-USART+LPUART1 and
// 6-USART+2xLPUART tiers.
// PIN MAPPING NOT VERIFIED against a real reference manual or reference
// hardware (no board with any of these chips in hand this session) -
// override MIOS32_UART6_{TX,RX}_{PORT,PIN,AF} in your project's
// mios32_config.h once you have real hardware. Chosen only to avoid an
// obvious collision with UART0..UART5's own default pins above.
// Clock source defaults to PCLK1 like every other port (see module-level
// comment) - LPUART's fixed x256 oversampling and PRESC-based BRR are
// handled in MIOS32_UART_BaudrateSet, not here.
#if defined(MIOS32_USE_UART6)
#ifndef MIOS32_UART6_TX_PORT
#define MIOS32_UART6_TX_PORT     GPIOA
#endif
#ifndef MIOS32_UART6_TX_PIN
#define MIOS32_UART6_TX_PIN      LL_GPIO_PIN_6
#endif
#ifndef MIOS32_UART6_TX_AF
#define MIOS32_UART6_TX_AF       LL_GPIO_AF_1
#endif
#ifndef MIOS32_UART6_RX_PORT
#define MIOS32_UART6_RX_PORT     GPIOA
#endif
#ifndef MIOS32_UART6_RX_PIN
#define MIOS32_UART6_RX_PIN      LL_GPIO_PIN_7
#endif
#ifndef MIOS32_UART6_RX_AF
#define MIOS32_UART6_RX_AF       LL_GPIO_AF_1
#endif
#ifndef MIOS32_UART6
#define MIOS32_UART6             LPUART1
#endif
#ifndef MIOS32_UART6_IRQ_CHANNEL
# if defined(MIOS32_G0_LPUART1_SHARED)
#  define MIOS32_UART6_IRQ_CHANNEL MIOS32_UART_SHARED_IRQ_CHANNEL
# else
#  define MIOS32_UART6_IRQ_CHANNEL LPUART1_IRQn
# endif
#endif
#ifndef MIOS32_UART6_IRQHANDLER_FUNC
# if defined(MIOS32_G0_LPUART1_SHARED)
#  define MIOS32_UART6_IRQHANDLER_FUNC MIOS32_UART_SHARED_IRQHANDLER_FUNC
# else
#  define MIOS32_UART6_IRQHANDLER_FUNC void LPUART1_IRQHandler(void)
# endif
#endif
#ifndef MIOS32_UART6_RESET_FUNC
#define MIOS32_UART6_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_LPUART1); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_LPUART1); }
#endif
#ifndef MIOS32_UART6_CLOCK_FUNC
#define MIOS32_UART6_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPUART1); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOA); }
#endif
#ifndef MIOS32_UART6_CLOCK_SOURCE
#define MIOS32_UART6_CLOCK_SOURCE LL_RCC_LPUART1_CLKSOURCE_PCLK1
#endif
#endif

// UART7 (LPUART2 peripheral) - exists ONLY on the 6-USART+2xLPUART tier
// (G0B1/G0C1), see MIOS32_USE_UART7 force-undef above. Always shares
// UART2's vector on this tier (MIOS32_UART2_IRQ_CHANNEL/IRQHANDLER_FUNC,
// already tier-conditional - see UART2 above) - there's no separate
// independent vector for LPUART2 on any G0 chip.
// PIN MAPPING NOT VERIFIED - see UART6 above, same caveat applies.
#if defined(MIOS32_USE_UART7)
#ifndef MIOS32_UART7_TX_PORT
#define MIOS32_UART7_TX_PORT     GPIOB
#endif
#ifndef MIOS32_UART7_TX_PIN
#define MIOS32_UART7_TX_PIN      LL_GPIO_PIN_10
#endif
#ifndef MIOS32_UART7_TX_AF
#define MIOS32_UART7_TX_AF       LL_GPIO_AF_4
#endif
#ifndef MIOS32_UART7_RX_PORT
#define MIOS32_UART7_RX_PORT     GPIOB
#endif
#ifndef MIOS32_UART7_RX_PIN
#define MIOS32_UART7_RX_PIN      LL_GPIO_PIN_11
#endif
#ifndef MIOS32_UART7_RX_AF
#define MIOS32_UART7_RX_AF       LL_GPIO_AF_4
#endif
#ifndef MIOS32_UART7
#define MIOS32_UART7             LPUART2
#endif
#ifndef MIOS32_UART7_IRQ_CHANNEL
#define MIOS32_UART7_IRQ_CHANNEL MIOS32_UART2_IRQ_CHANNEL
#endif
#ifndef MIOS32_UART7_IRQHANDLER_FUNC
#define MIOS32_UART7_IRQHANDLER_FUNC MIOS32_UART2_IRQHANDLER_FUNC
#endif
#ifndef MIOS32_UART7_RESET_FUNC
#define MIOS32_UART7_RESET_FUNC  { LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_LPUART2); LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_LPUART2); }
#endif
#ifndef MIOS32_UART7_CLOCK_FUNC
#define MIOS32_UART7_CLOCK_FUNC  { LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPUART2); LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOB); }
#endif
#ifndef MIOS32_UART7_CLOCK_SOURCE
#define MIOS32_UART7_CLOCK_SOURCE LL_RCC_LPUART2_CLKSOURCE_PCLK1
#endif
#endif


/////////////////////////////////////////////////////////////////////////////
// Local variables
/////////////////////////////////////////////////////////////////////////////

static u8  uart_midi_act=0;
static u8  uart_assigned_to_midi;
static u32 uart_baudrate[MIOS32_UART_MAX_PORTS];
static mios32_board_pin_mode_t  uart_tx_pin_mode[MIOS32_UART_MAX_PORTS];

// named per-port RX/TX buffers - only allocated for ports actually enabled
// via MIOS32_USE_UARTx, unlike the small per-port state above (baudrate,
// pin mode) and below (tail/head/size counters), which stay as cheap
// MIOS32_UART_MAX_PORTS-sized arrays regardless of enablement (a few bytes
// per port, not worth the indirection). The pointer tables below resolve
// each slot at compile time - NULL for any port not compiled in - so the
// existing generic array-indexed function bodies only need a NULL check
// added, no other logic changes.
#if defined(MIOS32_USE_UART0)
static u8 uart0_rx_buffer[MIOS32_UART_RX_BUFFER_SIZE];
static u8 uart0_tx_buffer[MIOS32_UART_TX_BUFFER_SIZE];
#endif
#if defined(MIOS32_USE_UART1)
static u8 uart1_rx_buffer[MIOS32_UART_RX_BUFFER_SIZE];
static u8 uart1_tx_buffer[MIOS32_UART_TX_BUFFER_SIZE];
#endif
#if defined(MIOS32_USE_UART2)
static u8 uart2_rx_buffer[MIOS32_UART_RX_BUFFER_SIZE];
static u8 uart2_tx_buffer[MIOS32_UART_TX_BUFFER_SIZE];
#endif
#if defined(MIOS32_USE_UART3)
static u8 uart3_rx_buffer[MIOS32_UART_RX_BUFFER_SIZE];
static u8 uart3_tx_buffer[MIOS32_UART_TX_BUFFER_SIZE];
#endif
#if defined(MIOS32_USE_UART4)
static u8 uart4_rx_buffer[MIOS32_UART_RX_BUFFER_SIZE];
static u8 uart4_tx_buffer[MIOS32_UART_TX_BUFFER_SIZE];
#endif
#if defined(MIOS32_USE_UART5)
static u8 uart5_rx_buffer[MIOS32_UART_RX_BUFFER_SIZE];
static u8 uart5_tx_buffer[MIOS32_UART_TX_BUFFER_SIZE];
#endif
#if defined(MIOS32_USE_UART6)
static u8 uart6_rx_buffer[MIOS32_UART_RX_BUFFER_SIZE];
static u8 uart6_tx_buffer[MIOS32_UART_TX_BUFFER_SIZE];
#endif
#if defined(MIOS32_USE_UART7)
static u8 uart7_rx_buffer[MIOS32_UART_RX_BUFFER_SIZE];
static u8 uart7_tx_buffer[MIOS32_UART_TX_BUFFER_SIZE];
#endif

