AddictiveInstruments/ADIOS/mios32/STM32G0xx/mios32_uart.c
static u8 * const rx_buffer_ptr[MIOS32_UART_MAX_PORTS] = {
#if defined(MIOS32_USE_UART0)
  uart0_rx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART1)
  uart1_rx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART2)
  uart2_rx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART3)
  uart3_rx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART4)
  uart4_rx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART5)
  uart5_rx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART6)
  uart6_rx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART7)
  uart7_rx_buffer,
#else
  NULL,
#endif
};
static u8 * const tx_buffer_ptr[MIOS32_UART_MAX_PORTS] = {
#if defined(MIOS32_USE_UART0)
  uart0_tx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART1)
  uart1_tx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART2)
  uart2_tx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART3)
  uart3_tx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART4)
  uart4_tx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART5)
  uart5_tx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART6)
  uart6_tx_buffer,
#else
  NULL,
#endif
#if defined(MIOS32_USE_UART7)
  uart7_tx_buffer,
#else
  NULL,
#endif
};

static volatile u8 rx_buffer_tail[MIOS32_UART_MAX_PORTS];
static volatile u8 rx_buffer_head[MIOS32_UART_MAX_PORTS];
static volatile u8 rx_buffer_size[MIOS32_UART_MAX_PORTS];

static volatile u8 tx_buffer_tail[MIOS32_UART_MAX_PORTS];
static volatile u8 tx_buffer_head[MIOS32_UART_MAX_PORTS];
static volatile u8 tx_buffer_size[MIOS32_UART_MAX_PORTS];


/////////////////////////////////////////////////////////////////////////////
//! Initializes UART interfaces
//! \param[in] mode currently only mode 0 supported
//! \return < 0 if initialisation failed
//! \note Applications shouldn't call this function directly, instead please use \ref MIOS32_COM or \ref MIOS32_MIDI layer functions
/////////////////////////////////////////////////////////////////////////////
s32 MIOS32_UART_Init(u32 mode)
{
  // currently only mode 0 supported
  if( mode != 0 )
    return -1; // unsupported mode

  // map UART pins and enable clocks
#if defined(MIOS32_USE_UART0) && MIOS32_UART0_ASSIGNMENT != 0
  MIOS32_UART0_RESET_FUNC;
  MIOS32_UART0_CLOCK_FUNC;
#endif
#if defined(MIOS32_USE_UART1) && MIOS32_UART1_ASSIGNMENT != 0
  MIOS32_UART1_RESET_FUNC;
  MIOS32_UART1_CLOCK_FUNC
#endif
#if defined(MIOS32_USE_UART2) && MIOS32_UART2_ASSIGNMENT != 0
  MIOS32_UART2_RESET_FUNC;
  MIOS32_UART2_CLOCK_FUNC
#endif
#if defined(MIOS32_USE_UART3) && MIOS32_UART3_ASSIGNMENT != 0
  MIOS32_UART3_RESET_FUNC;
  MIOS32_UART3_CLOCK_FUNC
#endif
#if defined(MIOS32_USE_UART4) && MIOS32_UART4_ASSIGNMENT != 0
  MIOS32_UART4_RESET_FUNC;
  MIOS32_UART4_CLOCK_FUNC
#endif
#if defined(MIOS32_USE_UART5) && MIOS32_UART5_ASSIGNMENT != 0
  MIOS32_UART5_RESET_FUNC;
  MIOS32_UART5_CLOCK_FUNC
#endif
#if defined(MIOS32_USE_UART6) && MIOS32_UART6_ASSIGNMENT != 0
  MIOS32_UART6_RESET_FUNC;
  MIOS32_UART6_CLOCK_FUNC
#endif
#if defined(MIOS32_USE_UART7) && MIOS32_UART7_ASSIGNMENT != 0
  MIOS32_UART7_RESET_FUNC;
  MIOS32_UART7_CLOCK_FUNC
#endif

  // initialize UARTs and clear buffers
  {
    u8 uart;
    for(uart=0; uart<MIOS32_UART_MAX_PORTS; ++uart) {
      rx_buffer_tail[uart] = rx_buffer_head[uart] = rx_buffer_size[uart] = 0;
      tx_buffer_tail[uart] = tx_buffer_head[uart] = tx_buffer_size[uart] = 0;

      MIOS32_UART_InitPortDefault(uart);
    }
  }

  // configure and enable UART interrupts
#if defined(MIOS32_USE_UART0) && MIOS32_UART0_ASSIGNMENT != 0
  MIOS32_IRQ_Install(MIOS32_UART0_IRQ_CHANNEL, MIOS32_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(MIOS32_UART0);
#endif
#if defined(MIOS32_USE_UART1) && MIOS32_UART1_ASSIGNMENT != 0
  MIOS32_IRQ_Install(MIOS32_UART1_IRQ_CHANNEL, MIOS32_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(MIOS32_UART1);
#endif
#if defined(MIOS32_USE_UART2) && MIOS32_UART2_ASSIGNMENT != 0
  MIOS32_IRQ_Install(MIOS32_UART2_IRQ_CHANNEL, MIOS32_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(MIOS32_UART2);
#endif
#if defined(MIOS32_USE_UART3) && MIOS32_UART3_ASSIGNMENT != 0
  MIOS32_IRQ_Install(MIOS32_UART3_IRQ_CHANNEL, MIOS32_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(MIOS32_UART3);
#endif
#if defined(MIOS32_USE_UART4) && MIOS32_UART4_ASSIGNMENT != 0
  MIOS32_IRQ_Install(MIOS32_UART4_IRQ_CHANNEL, MIOS32_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(MIOS32_UART4);
#endif
#if defined(MIOS32_USE_UART5) && MIOS32_UART5_ASSIGNMENT != 0
  MIOS32_IRQ_Install(MIOS32_UART5_IRQ_CHANNEL, MIOS32_IRQ_UART_PRIORITY);
  LL_USART_EnableIT_RXNE(MIOS32_UART5);
#endif
#if defined(MIOS32_USE_UART6) && MIOS32_UART6_ASSIGNMENT != 0
  MIOS32_IRQ_Install(MIOS32_UART6_IRQ_CHANNEL, MIOS32_IRQ_UART_PRIORITY);
  LL_LPUART_EnableIT_RXNE(MIOS32_UART6);
#endif
#if defined(MIOS32_USE_UART7) && MIOS32_UART7_ASSIGNMENT != 0
  MIOS32_IRQ_Install(MIOS32_UART7_IRQ_CHANNEL, MIOS32_IRQ_UART_PRIORITY);
  LL_LPUART_EnableIT_RXNE(MIOS32_UART7);
#endif

  // enable UARTs
#if defined(MIOS32_USE_UART0) && MIOS32_UART0_ASSIGNMENT != 0
  LL_USART_Enable(MIOS32_UART0);
  while((!(LL_USART_IsActiveFlag_TEACK(MIOS32_UART0))) || (!(LL_USART_IsActiveFlag_REACK(MIOS32_UART0)))){}
#endif
#if defined(MIOS32_USE_UART1) && MIOS32_UART1_ASSIGNMENT != 0
  LL_USART_Enable(MIOS32_UART1);
  while((!(LL_USART_IsActiveFlag_TEACK(MIOS32_UART1))) || (!(LL_USART_IsActiveFlag_REACK(MIOS32_UART1)))){}
#endif
#if defined(MIOS32_USE_UART2) && MIOS32_UART2_ASSIGNMENT != 0
  LL_USART_Enable(MIOS32_UART2);
  while((!(LL_USART_IsActiveFlag_TEACK(MIOS32_UART2))) || (!(LL_USART_IsActiveFlag_REACK(MIOS32_UART2)))){}
#endif
#if defined(MIOS32_USE_UART3) && MIOS32_UART3_ASSIGNMENT != 0
  LL_USART_Enable(MIOS32_UART3);
  while((!(LL_USART_IsActiveFlag_TEACK(MIOS32_UART3))) || (!(LL_USART_IsActiveFlag_REACK(MIOS32_UART3)))){}
#endif
#if defined(MIOS32_USE_UART4) && MIOS32_UART4_ASSIGNMENT != 0
  LL_USART_Enable(MIOS32_UART4);
  while((!(LL_USART_IsActiveFlag_TEACK(MIOS32_UART4))) || (!(LL_USART_IsActiveFlag_REACK(MIOS32_UART4)))){}
#endif
#if defined(MIOS32_USE_UART5) && MIOS32_UART5_ASSIGNMENT != 0
  LL_USART_Enable(MIOS32_UART5);
  while((!(LL_USART_IsActiveFlag_TEACK(MIOS32_UART5))) || (!(LL_USART_IsActiveFlag_REACK(MIOS32_UART5)))){}
#endif
#if defined(MIOS32_USE_UART6) && MIOS32_UART6_ASSIGNMENT != 0
  LL_LPUART_Enable(MIOS32_UART6);
  while((!(LL_LPUART_IsActiveFlag_TEACK(MIOS32_UART6))) || (!(LL_LPUART_IsActiveFlag_REACK(MIOS32_UART6)))){}
#endif
#if defined(MIOS32_USE_UART7) && MIOS32_UART7_ASSIGNMENT != 0
  LL_LPUART_Enable(MIOS32_UART7);
  while((!(LL_LPUART_IsActiveFlag_TEACK(MIOS32_UART7))) || (!(LL_LPUART_IsActiveFlag_REACK(MIOS32_UART7)))){}
#endif

