AddictiveInstruments/ADIOS/mios32/STM32G0xx/mios32_uart.c
  return 0; // no error
}


/////////////////////////////////////////////////////////////////////////////
//! \return 0 if UART is not assigned to a MIDI function
//! \return 1 if UART is assigned to a MIDI function
/////////////////////////////////////////////////////////////////////////////
s32 MIOS32_UART_IsAssignedToMIDI(u8 uart)
{
  if( uart >= MIOS32_UART_MAX_PORTS )
    return 0; // no UART available
  return (uart_assigned_to_midi & (1 << uart)) ? 1 : 0;
}


/////////////////////////////////////////////////////////////////////////////
//! Initializes a given UART interface based on given baudrate and TX output mode
//! \param[in] uart UART number (0..3)
//! \param[in] baudrate the baudrate
//! \param[in] tx_pin_mode the TX pin mode
//!   <UL>
//!     <LI>MIOS32_BOARD_PIN_MODE_OUTPUT_PP: TX pin configured for push-pull mode
//!     <LI>MIOS32_BOARD_PIN_MODE_OUTPUT_OD: TX pin configured for open drain mode
//!   </UL>
//! \param[in] is_midi MIDI or common UART interface?
//! \return < 0 if initialisation failed
/////////////////////////////////////////////////////////////////////////////
s32 MIOS32_UART_InitPort(u8 uart, u32 baudrate, mios32_board_pin_mode_t tx_pin_mode, u8 is_midi)
{
  LL_GPIO_InitTypeDef GPIO_InitStructure;
  LL_GPIO_StructInit(&GPIO_InitStructure);

  if( uart >= MIOS32_UART_MAX_PORTS )
    return -1; // unsupported UART

  // MIDI assignment
  if( is_midi ) {
    uart_assigned_to_midi |= (1 << uart);
  } else {
    uart_assigned_to_midi &= ~(1 << uart);
  }
  // store pin mode
  uart_tx_pin_mode[uart]=tx_pin_mode;

  GPIO_InitStructure.Speed = LL_GPIO_SPEED_FREQ_HIGH;

  switch( uart ) {
#if defined(MIOS32_USE_UART0) && MIOS32_UART0_ASSIGNMENT != 0
  case 0: {
    GPIO_InitStructure.Pin = MIOS32_UART0_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == MIOS32_BOARD_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = MIOS32_UART0_TX_AF;
    LL_GPIO_Init(MIOS32_UART0_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = MIOS32_UART0_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = MIOS32_UART0_RX_AF;
    LL_GPIO_Init(MIOS32_UART0_RX_PORT, &GPIO_InitStructure);

    MIOS32_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(MIOS32_USE_UART1) && MIOS32_UART1_ASSIGNMENT != 0
  case 1: {
    GPIO_InitStructure.Pin = MIOS32_UART1_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == MIOS32_BOARD_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = MIOS32_UART1_TX_AF;
    LL_GPIO_Init(MIOS32_UART1_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = MIOS32_UART1_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = MIOS32_UART1_RX_AF;
    LL_GPIO_Init(MIOS32_UART1_RX_PORT, &GPIO_InitStructure);

    MIOS32_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(MIOS32_USE_UART2) && MIOS32_UART2_ASSIGNMENT != 0
  case 2: {
    GPIO_InitStructure.Pin = MIOS32_UART2_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == MIOS32_BOARD_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = MIOS32_UART2_TX_AF;
    LL_GPIO_Init(MIOS32_UART2_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = MIOS32_UART2_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = MIOS32_UART2_RX_AF;
    LL_GPIO_Init(MIOS32_UART2_RX_PORT, &GPIO_InitStructure);

    MIOS32_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(MIOS32_USE_UART3) && MIOS32_UART3_ASSIGNMENT != 0
  case 3: {
    GPIO_InitStructure.Pin = MIOS32_UART3_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == MIOS32_BOARD_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = MIOS32_UART3_TX_AF;
    LL_GPIO_Init(MIOS32_UART3_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = MIOS32_UART3_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = MIOS32_UART3_RX_AF;
    LL_GPIO_Init(MIOS32_UART3_RX_PORT, &GPIO_InitStructure);

    MIOS32_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(MIOS32_USE_UART4) && MIOS32_UART4_ASSIGNMENT != 0
  case 4: {
    GPIO_InitStructure.Pin = MIOS32_UART4_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == MIOS32_BOARD_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = MIOS32_UART4_TX_AF;
    LL_GPIO_Init(MIOS32_UART4_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = MIOS32_UART4_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = MIOS32_UART4_RX_AF;
    LL_GPIO_Init(MIOS32_UART4_RX_PORT, &GPIO_InitStructure);

    MIOS32_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

#if defined(MIOS32_USE_UART5) && MIOS32_UART5_ASSIGNMENT != 0
  case 5: {
    GPIO_InitStructure.Pin = MIOS32_UART5_TX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = (tx_pin_mode == MIOS32_BOARD_PIN_MODE_OUTPUT_PP) ? LL_GPIO_OUTPUT_PUSHPULL : LL_GPIO_OUTPUT_OPENDRAIN;
    GPIO_InitStructure.Pull = LL_GPIO_PULL_NO;
    GPIO_InitStructure.Alternate = MIOS32_UART5_TX_AF;
    LL_GPIO_Init(MIOS32_UART5_TX_PORT, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = MIOS32_UART5_RX_PIN;
    GPIO_InitStructure.Mode  = LL_GPIO_MODE_ALTERNATE;
    GPIO_InitStructure.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
    GPIO_InitStructure.Pull  = LL_GPIO_PULL_UP;
    GPIO_InitStructure.Alternate = MIOS32_UART5_RX_AF;
    LL_GPIO_Init(MIOS32_UART5_RX_PORT, &GPIO_InitStructure);

    MIOS32_UART_BaudrateSet(uart, baudrate);
  } break;
#endif

