AddictiveInstruments/ADIOS/mios32/STM32G0xx/mios32_uart.c
  if( MIOS32_UART0->ISR & (1 << 7) ) { // check if TXE flag is set
    if( MIOS32_UART_TxBufferUsed(0) > 0 ) {
      s32 b = MIOS32_UART_TxBufferGet(0);
      if( b < 0 ) {
	MIOS32_UART0->TDR = 0xff;
      } else {
	MIOS32_UART0->TDR = b;
	if(b!=0xf8)uart_midi_act |=2;
      }
    } else {
      MIOS32_UART0->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif

#if defined(MIOS32_USE_UART3)
  if( MIOS32_UART3->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = MIOS32_UART3->RDR;
    if(b!=0xf8)uart_midi_act |=64;
    s32 status = MIOS32_UART_IsAssignedToMIDI(3) ? MIOS32_MIDI_SendByteToRxCallback(DIN3, b) : 0;

    if( status == 0 && MIOS32_UART_RxBufferPut(3, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( MIOS32_UART3->ISR & (1 << 7) ) { // check if TXE flag is set
    if( MIOS32_UART_TxBufferUsed(3) > 0 ) {
      s32 b = MIOS32_UART_TxBufferGet(3);
      if( b < 0 ) {
	MIOS32_UART3->TDR = 0xff;
      } else {
	MIOS32_UART3->TDR = b;
	if(b!=0xf8)uart_midi_act |=128;
      }
    } else {
      MIOS32_UART3->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif

#if defined(MIOS32_USE_UART4)
  if( MIOS32_UART4->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = MIOS32_UART4->RDR;
    s32 status = MIOS32_UART_IsAssignedToMIDI(4) ? MIOS32_MIDI_SendByteToRxCallback(DIN4, b) : 0;

    if( status == 0 && MIOS32_UART_RxBufferPut(4, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( MIOS32_UART4->ISR & (1 << 7) ) { // check if TXE flag is set
    if( MIOS32_UART_TxBufferUsed(4) > 0 ) {
      s32 b = MIOS32_UART_TxBufferGet(4);
      if( b < 0 ) {
	MIOS32_UART4->TDR = 0xff;
      } else {
	MIOS32_UART4->TDR = b;
      }
    } else {
      MIOS32_UART4->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif

#if defined(MIOS32_USE_UART5)
  if( MIOS32_UART5->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = MIOS32_UART5->RDR;
    s32 status = MIOS32_UART_IsAssignedToMIDI(5) ? MIOS32_MIDI_SendByteToRxCallback(DIN5, b) : 0;

    if( status == 0 && MIOS32_UART_RxBufferPut(5, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( MIOS32_UART5->ISR & (1 << 7) ) { // check if TXE flag is set
    if( MIOS32_UART_TxBufferUsed(5) > 0 ) {
      s32 b = MIOS32_UART_TxBufferGet(5);
      if( b < 0 ) {
	MIOS32_UART5->TDR = 0xff;
      } else {
	MIOS32_UART5->TDR = b;
      }
    } else {
      MIOS32_UART5->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif

#if defined(MIOS32_USE_UART6) && defined(MIOS32_G0_LPUART1_SHARED)
  if( MIOS32_UART6->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = MIOS32_UART6->RDR;
    s32 status = MIOS32_UART_IsAssignedToMIDI(6) ? MIOS32_MIDI_SendByteToRxCallback(DIN6, b) : 0;

    if( status == 0 && MIOS32_UART_RxBufferPut(6, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( MIOS32_UART6->ISR & (1 << 7) ) { // check if TXE flag is set
    if( MIOS32_UART_TxBufferUsed(6) > 0 ) {
      s32 b = MIOS32_UART_TxBufferGet(6);
      if( b < 0 ) {
	MIOS32_UART6->TDR = 0xff;
      } else {
	MIOS32_UART6->TDR = b;
      }
    } else {
      MIOS32_UART6->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
#endif
}
#endif


/////////////////////////////////////////////////////////////////////////////
// Interrupt handler for UART6 (LPUART1) on the 2-USART+LPUART1 tier only,
// where it has its own independent vector (LPUART1_IRQn) rather than
// sharing the USART3+ group above (see MIOS32_G0_LPUART1_SHARED).
/////////////////////////////////////////////////////////////////////////////
#if defined(MIOS32_USE_UART6) && !defined(MIOS32_G0_LPUART1_SHARED)
MIOS32_UART6_IRQHANDLER_FUNC
{
  if( MIOS32_UART6->ISR & (1 << 5) ) { // check if RXNE flag is set
    u8 b = MIOS32_UART6->RDR;
    s32 status = MIOS32_UART_IsAssignedToMIDI(6) ? MIOS32_MIDI_SendByteToRxCallback(DIN6, b) : 0;

    if( status == 0 && MIOS32_UART_RxBufferPut(6, b) < 0 ) {
      // here we could add some error handling
    }
  }

  if( MIOS32_UART6->ISR & (1 << 7) ) { // check if TXE flag is set
    if( MIOS32_UART_TxBufferUsed(6) > 0 ) {
      s32 b = MIOS32_UART_TxBufferGet(6);
      if( b < 0 ) {
	MIOS32_UART6->TDR = 0xff;
      } else {
	MIOS32_UART6->TDR = b;
      }
    } else {
      MIOS32_UART6->CR1 &= ~(1 << 7); // disable TXE interrupt (TXEIE=0)
    }
  }
}
#endif


/////////////////////////////////////////////////////////////////////////////
//! Returns and clears the per-UART MIDI RX/TX activity flags (used to drive
//! an activity LED); bit layout: UART0 RX=0x01 TX=0x02, UART1 RX=0x04 TX=0x08,
//! UART2 RX=0x10 TX=0x20, UART3 RX=0x40 TX=0x80.
//! \note Applications shouldn't call this function directly, instead please use \ref MIOS32_MIDI layer functions
/////////////////////////////////////////////////////////////////////////////
u8 MIOS32_UART_RXTX_Act(void){
	u8 status = 0;
	if(uart_midi_act){
		status=uart_midi_act;
	}
	uart_midi_act=0;

	return status; // no error
}


//! \}

#endif /* MIOS32_USE_UART */
